In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.4.3-cp39-cp39-win_amd64.whl (10.6 MB)
     -------------------------------------- 10.6/10.6 MB 749.1 kB/s eta 0:00:00
Requirement already satisfied: numpy>=1.18.5 in c:\users\haekyu\anaconda3\envs\week1\lib\site-packages (from pandas) (1.23.1)
Requirement already satisfied: pytz>=2020.1 in c:\users\haekyu\anaconda3\envs\week1\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\haekyu\anaconda3\envs\week1\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\haekyu\anaconda3\envs\week1\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pandas
Successfully installed pandas-1.4.3

In [3]:
import numpy as np
import pandas as pd

In [8]:
pd.options.display.max_rows

60

In [9]:
#판다스
#시리즈와 데이터 프레임

In [10]:
obj = pd.Series([4,7,-5,3])

In [11]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [15]:
obj = pd.Series(np.array([4,7,-5,3]))

In [13]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int32

In [16]:
type(obj.values)

numpy.ndarray

In [18]:
obj.index  #기본 index자료형이다

RangeIndex(start=0, stop=4, step=1)

In [19]:
obj = pd.Series(np.array([4,7,-5,3]), index = ["d","b","a","c"])

In [20]:
print(obj)

d    4
b    7
a   -5
c    3
dtype: int32

In [21]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [22]:
obj

d    4
b    7
a   -5
c    3
dtype: int32

In [23]:
obj.index = ["Bob", "steve", "Jeff", "Ryan"]

In [24]:
obj

Bob      4
steve    7
Jeff    -5
Ryan     3
dtype: int32

In [25]:
obj_2 = pd.Series(np.array([4,7,-5,3]), index = ["d","b","a","c"])

In [27]:
obj_2["a"]

-5

In [28]:
obj_2["a"] = 6

In [29]:
obj_2["a"]

6

In [30]:
obj_2

d    4
b    7
a    6
c    3
dtype: int32

In [32]:
obj_2[["c","a","d"]]  #안에 리스트를 넣어줘야함

c    3
a    6
d    4
dtype: int32

In [33]:
list_1 = ["c","a","d"]

In [35]:
bool_1 = obj>2

In [37]:
obj[bool_1]

Bob      4
steve    7
Ryan     3
dtype: int32

In [39]:
obj+1

Bob      5
steve    8
Jeff    -4
Ryan     4
dtype: int32

In [40]:
obj*3

Bob      12
steve    21
Jeff    -15
Ryan      9
dtype: int32

In [41]:
obj/3

Bob      1.333333
steve    2.333333
Jeff    -1.666667
Ryan     1.000000
dtype: float64

In [42]:
np.exp(obj)

Bob        54.598150
steve    1096.633158
Jeff        0.006738
Ryan       20.085537
dtype: float64

In [43]:
#시리즈는 길이가 고정되어 있으며 순서가 중요하다 중복도 가능하다.

In [44]:
sdata = {'ohio':35000, 'texax':71000, 'oregon':16000, 'utah':5000}

In [45]:
obj_3 = pd.Series(sdata)

In [46]:
print(obj_3)

ohio      35000
texax     71000
oregon    16000
utah       5000
dtype: int64

In [47]:
#사용되지 않은 key는 NaN으로 표기

In [51]:
states = ['california', 'ohio', 'oregon', 'texax']

In [54]:
obj_4 = pd.Series(sdata, index = states)
print(obj_4)
# NaN을 결측치라고 한다

california        NaN
ohio          35000.0
oregon        16000.0
texax         71000.0
dtype: float64

In [53]:
#역으로 시리즈를 사전으로

In [55]:
dict(obj_4)

{'california': nan, 'ohio': 35000.0, 'oregon': 16000.0, 'texax': 71000.0}

In [59]:
#in 연산자 인덱스 사용여부 key 사용여부와 동일한 방식으로 판단한다

In [57]:
'texax' in obj_4

True

In [58]:
'anseong' in obj_4

False

In [60]:
#결측치 확인
#isnull
#notnull
obj.isnull()

Bob      False
steve    False
Jeff     False
Ryan     False
dtype: bool

In [61]:
obj_4.isnull()

california     True
ohio          False
oregon        False
texax         False
dtype: bool

In [62]:
obj_4.notnull()

california    False
ohio           True
oregon         True
texax          True
dtype: bool

In [63]:
obj.notnull()

Bob      True
steve    True
Jeff     True
Ryan     True
dtype: bool

In [65]:
obj_4.isnull().sum() #결측치 갯수 확인가능

1

In [67]:
obj_4.isnull().any()  #결측치가 있는지 확인하는 법

True

In [68]:
obj.isnull().any()

False

In [70]:
#시리즈 공동으로 사용하는 항목에 대해서만 연산가능
obj_3 + obj_4  #더할 수없는것은 NaN으로

california         NaN
ohio           70000.0
oregon         32000.0
texax         142000.0
utah               NaN
dtype: float64

In [71]:
# 'name'속성
# index 객체의 정보를 저장

In [72]:
obj_4.name

In [73]:
obj_4.name = "pop"

In [74]:
obj_4.name

'pop'

In [75]:
obj_4

california        NaN
ohio          35000.0
oregon        16000.0
texax         71000.0
Name: pop, dtype: float64

In [76]:
obj_4.index.name = 'state'

In [78]:
obj_4  #인덱스의 이름 지정

state
california        NaN
ohio          35000.0
oregon        16000.0
texax         71000.0
Name: pop, dtype: float64

In [79]:
# 데이터 프레임
#인덱스를 공유하는 여러가지 시리즈를 공유한다

In [81]:
import pandas as pd

In [84]:
series1 = pd.Series([4,5,6,3,10], name = "Mango")

In [85]:
series2 = pd.Series([4,2,6,1,17], name = "Apple")

In [86]:
series3 = pd.Series([7,1,23,5,9], name = "Banana")

In [87]:
pd.DataFrame({"Mango":series1, "Apple":series2,"Banana":series3})

   Mango  Apple  Banana
0      4      4       7
1      5      2       1
2      6      6      23
3      3      1       5
4     10     17       9

In [88]:
pd.DataFrame({series1.name:series1, series2.name:series2,series3.name:series3})

   Mango  Apple  Banana
0      4      4       7
1      5      2       1
2      6      6      23
3      3      1       5
4     10     17       9

In [89]:
pd.concat([series1,series2, series3])

0     4
1     5
2     6
3     3
4    10
0     4
1     2
2     6
3     1
4    17
0     7
1     1
2    23
3     5
4     9
dtype: int64

In [91]:
pd.concat([series1,series2, series3], axis = 1)
#pd.concat 이어붙이다

   Mango  Apple  Banana
0      4      4       7
1      5      2       1
2      6      6      23
3      3      1       5
4     10     17       9

In [92]:
#데이터프레임 생성 리스트로

In [93]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada', 'NY', 'NY', 'NY'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003, 2002, 2003, 2004],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 8.3, 8.4, 8.5]}

In [94]:
frame = pd.DataFrame(data)

In [95]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4
8      NY  2004  8.5

In [97]:
# head() 지정된 크기만큼 행 출력
# 처음이 5개 행만 보여준다

In [99]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [100]:
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [101]:
frame.head(8)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4

In [102]:
frame.head(-1)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4

In [103]:
#tail 행을 뒤에서 부터 출력
frame.tail()

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4
8      NY  2004  8.5

In [104]:
frame.tail(-1)

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6      NY  2002  8.3
7      NY  2003  8.4
8      NY  2004  8.5

In [106]:
#데이터 프레임 column속성을 이용해 열의 순서를 지정해 새로운 dataframe만들수 있다
pd.DataFrame(data, columns = ["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2
6  2002      NY  8.3
7  2003      NY  8.4
8  2004      NY  8.5

In [110]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"]) #새로운 열 추가 가능하다
frame2
# 값이 없어서 NaN으로 저장된다

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN
6  2002      NY  8.3  NaN
7  2003      NY  8.4  NaN
8  2004      NY  8.5  NaN

In [111]:
frame2_ = frame2.copy() #dataframe복사  보통 복사하여 사용한다

In [114]:
import numpy as np

In [116]:
frame2_["debt2"] = np.linspace(0,1,9)

In [117]:
frame2_

   year   state  pop debt  debt2
0  2000    Ohio  1.5  NaN  0.000
1  2001    Ohio  1.7  NaN  0.125
2  2002    Ohio  3.6  NaN  0.250
3  2001  Nevada  2.4  NaN  0.375
4  2002  Nevada  2.9  NaN  0.500
5  2003  Nevada  3.2  NaN  0.625
6  2002      NY  8.3  NaN  0.750
7  2003      NY  8.4  NaN  0.875
8  2004      NY  8.5  NaN  1.000

In [118]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN
6  2002      NY  8.3  NaN
7  2003      NY  8.4  NaN
8  2004      NY  8.5  NaN

In [120]:
frame2_["debt3"] = np.linspace(0,1,10)  #길이가 같아야 넣을수있다

ValueError: Length of values (10) does not match length of index (9)

In [121]:
frame2_.columns

Index(['year', 'state', 'pop', 'debt', 'debt2'], dtype='object')

In [122]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [123]:
#index 속성
frame2=pd.DataFrame(data, index = ["one", "two", "three", "four", "five", "six", "seven", "eight", "nine"])

In [124]:
frame2

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2
seven      NY  2002  8.3
eight      NY  2003  8.4
nine       NY  2004  8.5

In [125]:
#columns index등 여러속성 지정가능하다

In [129]:
#index 속성
frame2=pd.DataFrame(data, columns = ["year", "state", "pop", "debt"], index = ["one", "two", "three", "four", "five", "six", "seven", "eight", "nine"])

In [130]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN
seven  2002      NY  8.3  NaN
eight  2003      NY  8.4  NaN
nine   2004      NY  8.5  NaN

In [135]:
# column속성으로 확인하는 방법
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
seven        NY
eight        NY
nine         NY
Name: state, dtype: object

In [133]:
#dir 확이할때
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
seven        NY
eight        NY
nine         NY
Name: state, dtype: object

In [134]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
seven    2002
eight    2003
nine     2004
Name: year, dtype: int64

In [137]:
#리스트가 아닌 속성으로 가져올때 빈칸이 있으면 오류가 발생
frame2['Ohio state'] = frame2.state == 'Ohio'

In [138]:
frame2

       year   state  pop debt  Ohio state
one    2000    Ohio  1.5  NaN        True
two    2001    Ohio  1.7  NaN        True
three  2002    Ohio  3.6  NaN        True
four   2001  Nevada  2.4  NaN       False
five   2002  Nevada  2.9  NaN       False
six    2003  Nevada  3.2  NaN       False
seven  2002      NY  8.3  NaN       False
eight  2003      NY  8.4  NaN       False
nine   2004      NY  8.5  NaN       False

In [139]:
frame2["Ohio state"]

one       True
two       True
three     True
four     False
five     False
six      False
seven    False
eight    False
nine     False
Name: Ohio state, dtype: bool

In [140]:
frame2.Ohio state
#띄어쓰기 때문에 오류가 발생한다

SyntaxError: invalid syntax (2626411228.py, line 1)

In [141]:
del frame2["Ohio state"] #삭제하기

In [142]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN
seven  2002      NY  8.3  NaN
eight  2003      NY  8.4  NaN
nine   2004      NY  8.5  NaN

In [143]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
# drop() 사용가능

In [144]:
# 행인덱싱 loc 속성으로 지정된 인덱스를 이용

In [145]:

frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [147]:
frame2.loc[["three","four"]]

       year   state  pop debt
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN

In [148]:
# 원하는 인덱스만 찾아서 보는법
# iloc 정수 인덱싱 가능

In [150]:
# 열 업데이트
# 항목값 지정 및 변경가능

In [151]:
frame2["debt"]

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
seven    NaN
eight    NaN
nine     NaN
Name: debt, dtype: object

In [154]:
frame2["debt"] = 17.0  #전체가 지정된다

In [153]:
frame2["debt"]

one      17.0
two      17.0
three    17.0
four     17.0
five     17.0
six      17.0
seven    17.0
eight    17.0
nine     17.0
Name: debt, dtype: float64

In [155]:
frame2["debt"] = np.arange(0,9)

In [156]:
frame2["debt"]

one      0
two      1
three    2
four     3
five     4
six      5
seven    6
eight    7
nine     8
Name: debt, dtype: int32

In [157]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5
seven  2002      NY  8.3     6
eight  2003      NY  8.4     7
nine   2004      NY  8.5     8

In [158]:
#시리즈로 값 추가
val = pd.Series([-1.2, -1.5, -1.7, 2.2], index = ['two', 'four', 'five', 'eleven'])

In [159]:
val

two      -1.2
four     -1.5
five     -1.7
eleven    2.2
dtype: float64

In [160]:
frame2['debt'] = val

In [162]:
frame2  #있는값만 들어가고  나머지는 NaN

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN
seven  2002      NY  8.3   NaN
eight  2003      NY  8.4   NaN
nine   2004      NY  8.5   NaN

In [163]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [164]:
frame3 = pd.DataFrame(pop)

In [166]:
#리스트로 데이터 프레임 만들기
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [177]:
nevada = pd.Series({2001: 2.4, 2002: 2.9}, name="Nevada")
nevada

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [178]:
ohio = pd.Series({2000: 1.5, 2001:1.7, 2002:3.6}, name = "Ohio")

In [179]:
ohio

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [180]:
pd.concat([nevada, ohio], axis = 1)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [181]:
#전치 데이터 프레임도 가능하다
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [183]:
# index 속성
obj = pd.Series(range(3), index = ["a","b","c"])

In [184]:
obj

a    0
b    1
c    2
dtype: int64

In [185]:
type(obj.index)

pandas.core.indexes.base.Index

In [186]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [188]:
# 인덱싱 슬라이싱은 리스트 1차원 어레이와 동일하게 작동한다
index = obj.index

In [189]:
index[1:]

Index(['b', 'c'], dtype='object')

In [190]:
list(index)

['a', 'b', 'c']

In [191]:
set(index)

{'a', 'b', 'c'}

In [194]:
#coulmn속성
#열에 사용된이름은 index 객체로 columns 속성값으로 지정
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [195]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [197]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64')

In [198]:
#in 연산자
"Ohio" in frame3.columns

True

In [199]:
2020 in frame3.index

False

In [202]:
#중복인덱스 
#인덱스 중복해서 사용가능
dup_labels= pd.Index(["one", "two", "two", "three", "three", "three"])

In [203]:
dup_labels

Index(['one', 'two', 'two', 'three', 'three', 'three'], dtype='object')

In [205]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN
seven  2002      NY  8.3   NaN
eight  2003      NY  8.4   NaN
nine   2004      NY  8.5   NaN

In [206]:
pd.DataFrame(frame2, index = dup_labels)

       year state  pop  debt
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN
three  2002  Ohio  3.6   NaN
three  2002  Ohio  3.6   NaN

In [207]:
import pandas as pd
import numpy as np

In [208]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

In [215]:
chipo_df = pd.DataFrame(chipo)

In [224]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [225]:
chipo.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [216]:
chipo_df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [217]:
chipo_df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [210]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [220]:
chipo_df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [222]:
chipo_df.shape

(4622, 5)

In [211]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

In [223]:
print(type(chipo))
print(type(chipo_df))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [212]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [214]:
chipo.shape

(4622, 5)

In [226]:
# Agenda
#리인덱싱 인덱스를 다시 지정

In [230]:
obj2 = obj.reindex(["a", "b", "c", "d" ,"e"])
#추가되면 NaN

In [228]:
obj2

a    0.0
b    1.0
c    2.0
d    NaN
e    NaN
dtype: float64

In [231]:
obj2 = obj.reindex(["a","c","d","e"])

In [232]:
obj2

a    0.0
c    2.0
d    NaN
e    NaN
dtype: float64

In [233]:
#NaN값 채우기 fill로 채워주기

In [234]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 5])
obj3

0      blue
2    purple
5    yellow
dtype: object

In [235]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4       NaN
5    yellow
dtype: object

In [237]:
obj3.reindex(range(6), method = "ffill")
#앞의 값으로 NaN으로 채워준다

0      blue
1      blue
2    purple
3    purple
4    purple
5    yellow
dtype: object

In [239]:
obj3.reindex(range(-1,6), method = "ffill")
#위쪽에 위치한 값이 없다면 결측치가 된다

-1       NaN
0       blue
1       blue
2     purple
3     purple
4     purple
5     yellow
dtype: object

In [242]:
#가장 가까운 값으로 채울수도 있다.
# method= 'nearest'
obj3.reindex(range(6), method = 'nearest')
#거리가 같을경우 자신 아래쪽에 있는 값으로

0      blue
1    purple
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [244]:
#fill_value 채우기
obj3.reindex(range(6), fill_value = "black")

0      blue
1     black
2    purple
3     black
4     black
5    yellow
dtype: object

In [245]:
#obj3 자체는 변하지 않는다

In [247]:
#데이터프레임 리인덱싱 시리즈 인덱싱과 동일하다
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [249]:
frame.reindex(["a","b","c","d"])  #index기준으로 작동

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [250]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [251]:
#drop()
obj = pd.Series(np.arange(5), index = ["a","b","c","d","e"])

In [252]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [255]:
obj.drop("c") #지워진 상태를 보여주기

a    0
b    1
d    3
e    4
dtype: int32

In [254]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [258]:
obj.drop(["c","d"]) #원본데이터는 변하지 않은상태로

a    0
b    1
e    4
dtype: int32

In [257]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [261]:
# inplace = True 원본변경이 된다.
# obj.drop(["c","d"] ,inplace = True)

In [262]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [266]:
data.drop(["Colorado","Utah"]) #행 기준으로 삭제

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [265]:
#열기준 작동하게 하려면 axis = 1 지정한다
# data.drop(["two"], axis = 1)
data.drop(["two"], axis = "columns")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [267]:
#인덱싱 슬라이싱 필터링
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [268]:
obj["b"]

1.0

In [269]:
obj[1]

1.0

In [270]:
obj[2:5]

c    2.0
d    3.0
dtype: float64

In [272]:
obj[["b","a","d"]] #여러개 리스트로 인덱싱

b    1.0
a    0.0
d    3.0
dtype: float64

In [273]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [274]:
obj[obj<1]

a    0.0
dtype: float64

In [275]:
obj["b":"d"]

b    1.0
c    2.0
d    3.0
dtype: float64

In [276]:
obj["b":"d"] = 5

In [277]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [281]:
#label 인덱싱 슬라이싱
obj2 = obj.reindex(["b","d","c","a"])

In [282]:
obj2

b    5.0
d    5.0
c    5.0
a    0.0
dtype: float64

In [283]:
obj2[["b","d"]]

b    5.0
d    5.0
dtype: float64

In [284]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [285]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [286]:
data[["two","three"]]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [287]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [288]:
mask1 = data["three"]>5

In [291]:
data[mask1]
#three 속성이 5보다 큰 값들만 출력한다

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [295]:
# ~mask1 mask1의 반대 연산
data[~mask1]  =0

In [294]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [296]:
#행단위 인덱싱 슬라이싱
#loc() 라벨을 이용할경우
#iloc() 정수 인덱스를 이용할경우

In [297]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [299]:
data.iloc[1]  #같은 결과를 보여준다

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [300]:
#기본적으로 행과 열에 대해 동시에 인덱싱과 슬라이싱이 가능
#2차원 넘파이 어레이와 비슷하게 동작한다.

In [301]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [302]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [304]:
data.iloc[1,1:3]

two      5
three    6
Name: Colorado, dtype: int32

In [305]:
data.iloc[1,[3,0,2]]

four     7
one      4
three    6
Name: Colorado, dtype: int32

In [306]:
data.iloc[[1,2,3],[3,0,2]]

          four  one  three
Colorado     7    4      6
Utah        11    8     10
New York    15   12     14

In [307]:
data.loc[:"Colorado"]

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    5      6     7

In [308]:
data.loc[:"Colorado",:"three"]

          one  two  three
Ohio        0    0      0
Colorado    4    5      6

In [309]:
#인덱싱 슬라이싱 이후 필터링 적용이 가능하다
data.loc[:"Colorado",:"three"][data.three>5]

C:\Users\haekyu\AppData\Local\Temp\ipykernel_7536\1010603154.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  data.loc[:"Colorado",:"three"][data.three>5]

          one  two  three
Colorado    4    5      6

In [310]:
#산술연산
#연산에 사용 모든 인덱스는 포함
#공통으로 이용되는 인덱스만 적용 나머지는 NaN

In [311]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [312]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [313]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [314]:
s1 - s2

a    9.4
c   -6.1
d    NaN
e    3.0
f    NaN
g    NaN
dtype: float64

In [317]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns = list("bcd"), index = ["Ohio","Texax","Colorado"])

In [318]:
df2 = pd.DataFrame(np.arange(12).reshape(4,3),columns = list("bde"), index = ["Utah","Ohio","Texax","Oregon"])

In [319]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texax     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [320]:
#연산과정 결측치 채우기
df1.add(df2, fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texax     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [321]:
df2.add(df1, fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texax     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [322]:
#데이터프레임 시리즈 사이 연산
arr = np.arange(12).reshape((3,4))

In [324]:
arr[0]

array([0, 1, 2, 3])

In [325]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [326]:
arr[:,1]

array([1, 5, 9])

In [328]:
arr-arr[:,1]  #shape이 맞지 않아서 오류가 발생한다

ValueError: operands could not be broadcast together with shapes (3,4) (3,)

In [331]:
df2
df2.shape

(4, 3)

In [332]:
series = df2.iloc[0]

In [335]:
#인덱스가 공통으로 존재하면 브로드캐스팅이 적용된다
#행단위
df2 - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texax   6  6  6
Oregon  9  9  9

In [337]:
#열단위 연산도 가능하다
series3 = df2["d"]

In [339]:
#sub 메서드를 이용해 열단위 연산도 가능하다
df2.sub(series3, axis = 0)
# df2.sub(series3, axis = index)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texax  -1  0  1
Oregon -1  0  1

In [341]:
#함수 적용
    #유니버셜 함수는 넘파이의 경우와 동일하게 작용한다

In [342]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.813857  0.701168 -0.405722
Ohio   -2.397898 -1.067915  0.195509
Texas   1.482719  1.519008  1.703647
Oregon  0.789906 -0.622441  1.738559

In [343]:
np.abs(frame)

               b         d         e
Utah    0.813857  0.701168  0.405722
Ohio    2.397898  1.067915  0.195509
Texas   1.482719  1.519008  1.703647
Oregon  0.789906  0.622441  1.738559

In [345]:
np.abs(frame["b"])

Utah      0.813857
Ohio      2.397898
Texas     1.482719
Oregon    0.789906
Name: b, dtype: float64

In [346]:
np.exp(frame["b"])

Utah      2.256594
Ohio      0.090909
Texas     4.404907
Oregon    2.203188
Name: b, dtype: float64

In [349]:
#함수를 만들어버림
format = lambda x :"%.2f" %x

In [348]:
#시리즈에 적용
frame["e"].map(format)

Utah      -0.41
Ohio       0.20
Texas      1.70
Oregon     1.74
Name: e, dtype: object

In [350]:
frame.applymap(format)

            b      d      e
Utah     0.81   0.70  -0.41
Ohio    -2.40  -1.07   0.20
Texas    1.48   1.52   1.70
Oregon   0.79  -0.62   1.74

In [353]:
def func_1(x):
    num = np.round(x, 3)
    return num

In [354]:
frame.applymap(func_1)

            b      d      e
Utah    0.814  0.701 -0.406
Ohio   -2.398 -1.068  0.196
Texas   1.483  1.519  1.704
Oregon  0.790 -0.622  1.739

In [357]:
#object는 보통 없애준다
#apply 메서드

#행또는 열단위로 함수를 적용하려면 apply()를 활용한다
f1 = lambda x : x.max() - x.min()

In [358]:
frame.apply(f1, axis = "columns")

Utah      1.219579
Ohio      2.593407
Texas     0.220928
Oregon    2.361000
dtype: float64

In [359]:
frame.apply(f1, axis = 1)

Utah      1.219579
Ohio      2.593407
Texas     0.220928
Oregon    2.361000
dtype: float64

In [360]:
def func_2(x):
    return x.max() - x.min()

In [361]:
frame.apply(func_2, axis = 1)

Utah      1.219579
Ohio      2.593407
Texas     0.220928
Oregon    2.361000
dtype: float64

In [362]:
#정렬
#행과 열의 인덱스로 정렬할수있다
#sort_index()
obj = pd.Series(range(4), index = ["d","a","b","c"])

In [363]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [366]:
obj.sort_index()   #오름차순

a    1
b    2
c    3
d    0
dtype: int64

In [367]:
obj.sort_index(ascending = False) #내림차순

d    0
c    3
b    2
a    1
dtype: int64

In [374]:
frame = pd.DataFrame(np.arange(8).reshape((2,4))
                     ,index = ["three", "one"], 
                     columns = ["d", "a" , "b" ,"c"])

In [372]:
frame.sort_index() #index를 기준으로 정렬한다

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [373]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [375]:
obj = pd.Series([4,7,-3,2])

In [376]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [377]:
#데이터프레임은 by 키워드를 통해 열의 label을 지정해야한다
frame =pd.DataFrame({"b":[4,7,-3,2],"a":[0,1,0,1]})

In [378]:
frame.sort_values(by = "b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [380]:
# a를 먼저 정렬한 다음에  a가 같은 값이면 b열의 항목들 순서대로 정렬한다.
frame.sort_values(by = ["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [381]:
frame.sort_values(by = ["b","a"])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [382]:
#group_by
#데이터를 특정기준으로 그룹핑할떄 활용
df = pd.DataFrame({
    'city': ['busan', 'busan', 'busan', 'busan', 'seoul', 'seoul', 'seoul'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})

In [383]:
df

    city  fruits  price  quantity
0  busan   apple    100         1
1  busan  orange    200         2
2  busan  banana    250         3
3  busan  banana    300         4
4  seoul   apple    150         5
5  seoul   apple    200         6
6  seoul  banana    400         7

In [387]:
df.groupby(by = "city").count()

       fruits  price  quantity
city
busan       4      4         4
seoul       3      3         3

In [388]:
df.groupby(by = "city").mean()

       price  quantity
city
busan  212.5       2.5
seoul  250.0       6.0

In [394]:
#aggregate() 여려 통계함수 동시에 사용가능

df.groupby(by ="city").aggregate([np.sum, np.mean])

C:\Users\haekyu\AppData\Local\Temp\ipykernel_7536\3471986940.py:3: FutureWarning: ['fruits'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby(by ="city").aggregate([np.sum, np.mean])

      price        quantity
        sum   mean      sum mean
city
busan   850  212.5       10  2.5
seoul   750  250.0       18  6.0

In [393]:
df.groupby(by=["city", "fruits"]).mean()

              price  quantity
city  fruits
busan apple   100.0       1.0
      banana  275.0       3.5
      orange  200.0       2.0
seoul apple   175.0       5.5
      banana  400.0       7.0

In [396]:
#연습문제

import pandas as pd
import numpy as np

In [504]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

In [398]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [399]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [430]:
type(chipo)

pandas.core.frame.DataFrame

In [434]:
df_1 = chipo.groupby(by = "item_name").sum()

In [490]:
df_1.sort_values("quantity", ascending = False).head()
#Chicken Bowl 761

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [445]:
df_2 = chipo.groupby("choice_description").sum()

In [491]:
df_2.sort_values("quantity", ascending = False).head()
#diet coke 159

                                                    order_id  quantity
choice_description
[Diet Coke]                                           123455       159
[Coke]                                                122752       143
[Sprite]                                               80426        89
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     43088        49
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     36041        42

In [460]:
chipo.sort_values(by = "quantity").sum()
#4972

C:\Users\haekyu\AppData\Local\Temp\ipykernel_7536\1583954657.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  chipo.sort_values(by = "quantity").sum()

order_id                                                4285772
quantity                                                   4972
item_name     Chips and Fresh Tomato SalsaCanned SodaBottled...
item_price    $2.39 $1.09 $1.09 $1.69 $8.49 $2.39 $11.75 $1....
dtype: object

In [494]:
#apply적용해주면 된다
# chipo.item_price.sum()

In [493]:
def sp_d(x):
    x_list = x.split("$")
    return float(x_list[1])

In [496]:
chipo.item_price.apply(sp_d)
#apply로 함수를 적용해서 문자열을 실수로 바꿀수있다

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [505]:
chipo.item_price = chipo.item_price.apply(sp_d)

In [510]:
(chipo["quantity"]*chipo["item_price"]).sum()  #갯수와 가격을 곱한 값을 구하다

39237.02

In [529]:
chipo.order_id.value_counts().count()

1834

In [520]:
chipo["total_price"] = (chipo["quantity"]*chipo["item_price"])

In [524]:
chipo.groupby(by = "order_id").sum().mean()###  id별로 가격이 다 더해지고 주문수도 더해진다

quantity        2.711014
item_price     18.811429
total_price    21.394231
dtype: float64

In [528]:
# chipo_2 =pd.DataFrame(chipo['item_price'].str.split('$').tolist())
# chipo["price"] =pd.to_numeric(chipo_2[1])
# chipo["price"].sum()
# chipo["price"].sum()/chipo["order_id"].count()

In [502]:
chipo.drop_duplicates(["item_name"]).count()

order_id              50
quantity              50
item_name             50
choice_description    38
item_price            50
price                 50
dtype: int64

In [527]:
chipo.item_name.value_counts().count()  #총 판매된 품목

50